In [5]:
import pandas as pd

In [1]:
data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

In [6]:
employees = pd.DataFrame(data)

employees

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000
3         104    David  Marketing   70000
4         105     Emma      Sales   65000

In [7]:
employees.head(3)

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000

In [45]:
employees['Salary'].describe()

count        5.00000
mean     70000.00000
std       7905.69415
min      60000.00000
25%      65000.00000
50%      70000.00000
75%      75000.00000
max      80000.00000
Name: Salary, dtype: float64

In [49]:
# employees.groupby('Department').count()['Name']
employees['Department'].value_counts()

Department
HR           1
IT           1
Finance      1
Marketing    1
Sales        1
Name: count, dtype: int64

In [20]:
employees['Salary'].mean()

70000.0

In [53]:
# employees.sort_values(by='Salary', ascending= False).head(1)

max_salary = employees['Salary'].max()
employees[employees['Salary'] == max_salary]

   EmployeeID     Name Department  Salary  Salary Increase
2         103  Charlie    Finance   80000          88000.0

In [57]:
# employees.groupby('Department')['Salary'].mean().sort_values().head(1)

employees.groupby('Department')['Salary'].mean().idxmin()

'HR'

In [56]:
employees['Salary Increase'] = employees['Salary'] * 1.1
employees

   EmployeeID     Name Department  Salary  Salary Increase
0         101    Alice         HR   60000          66000.0
1         102      Bob         IT   75000          82500.0
2         103  Charlie    Finance   80000          88000.0
3         104    David  Marketing   70000          77000.0
4         105     Emma      Sales   65000          71500.0